# ClosedShell Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..ClosedShell Property
Space Class See Also
---
Return the closedShell of the space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public GeometryElement ClosedShell { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ClosedShell As GeometryElement
	Get
```

Visual C++
---
```text
public:
property GeometryElement^ ClosedShell {
	GeometryElement^ get ();
}
```

# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace